In [1]:
# extract information with age greater than 25 from the following list of dictionaries
data = [{"name": "Alice", "age": 28}, {"name": "Bob", "age": 24}, {"name": "Charlie", "age": 30}]

In [2]:
# use list comprehension to flatten the matrix
matrix = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [15]:
# use enumerate() for looping to add 5 extra point to each grade in the list, the 5th one add 10 
grades = [88, 92, 78, 65, 50, 94]

In [17]:
#for i in range (len(grades)):
for i, value in enumerate(grades):
    if i != 4:
        grades[i] = value + 5
    else:
        grades[i] = value + 10
grades

[93, 97, 83, 70, 60, 99]

In [34]:
# filter out elements depend on their index: 
# use list comprehension and enumerate() to get elements with even index
data = [100, 200, 300, 400, 500]

In [45]:
data = [93, 97, 83, 70, 60, 99]
def is_prime(n):
    if n <= 3:
        return True
    if n % 2 == 0 or n % 3 == 0:
        return False
    i = 5
    while i * i <= n:
        if n % i == 0 or n % (i + 2) == 0:
            return False
        i += 6
    return True

# print only prime value:
prime_values = [value for value in data if is_prime(value)]
prime_values

[97, 83]

In [37]:
data_new = []
for i, value in enumerate(data):
    if i % 2 == 0:
        data_new.append(value) 
print(data_new)

[100, 300, 500]

In [38]:
# another way:
data_new2 = []
data_new2 = [value for i, value in enumerate(data) if i % 2 == 0]
data_new2

[100, 300, 500]

In [50]:
# create and print a dictionary from lists using zip()
keys = ['name', 'age', 'grade']
values = ['Alice', 25, 'A']

In [53]:
my_dict = dict(zip(keys, values))
print(my_dict)

{'name': 'Alice', 'age': 25, 'grade': 'A'}

In [67]:
# sort the dictionary based on the ages using lambda
students = [
    {'name': "John", 'grade': "A", 'age': 20}, 
    {'name': "Jane", 'grade': "B", 'age': 21}, 
    {'name': "Joss", 'grade': "A+", 'age': 19}, 
    {'name': "Jack", 'grade': "A-", 'age': 16}, 
    {'name': "Dave", 'grade': "C", 'age': 25}, 
]

In [70]:
students_by_age = sorted(students, key=lambda dic: dic['age'])
students_by_age

[{'name': 'Jack', 'grade': 'A-', 'age': 16},
 {'name': 'Joss', 'grade': 'A+', 'age': 19},
 {'name': 'John', 'grade': 'A', 'age': 20},
 {'name': 'Jane', 'grade': 'B', 'age': 21},
 {'name': 'Dave', 'grade': 'C', 'age': 25}]

[{'name': 'Jack', 'grade': 'A-', 'age': 16},
 {'name': 'Joss', 'grade': 'A+', 'age': 19},
 {'name': 'John', 'grade': 'A', 'age': 20},
 {'name': 'Jane', 'grade': 'B', 'age': 21},
 {'name': 'Dave', 'grade': 'C', 'age': 25}]

In [81]:
# Sort by age, then by salary if ages are the same
# use lambda
employees = [
    {'name': 'Alice', 'age': 25, 'salary': 80000},
    {'name': 'Bob', 'age': 25, 'salary': 50000},
    {'name': 'Charlie', 'age': 35, 'salary': 120000},
]

In [82]:
employees_by_age = sorted(employees, key=lambda dic: dic['age'])
employees_by_age

[{'name': 'Alice', 'age': 25, 'salary': 80000},
 {'name': 'Bob', 'age': 25, 'salary': 50000},
 {'name': 'Charlie', 'age': 35, 'salary': 120000}]

In [83]:
employees_by_age_salary = sorted(employees, key=lambda dic: (dic['age'], dic['salary']))
employees_by_age_salary

[{'name': 'Bob', 'age': 25, 'salary': 50000},
 {'name': 'Alice', 'age': 25, 'salary': 80000},
 {'name': 'Charlie', 'age': 35, 'salary': 120000}]

[{'name': 'Bob', 'age': 25, 'salary': 50000}, {'name': 'Alice', 'age': 30, 'salary': 80000}, {'name': 'Charlie', 'age': 35, 'salary': 120000}]

In [45]:
# Generators are highly useful in data-heavy applications:

# Reading Large Files: Use generators to read large files line by line without loading the entire file into memory.
# Data Streaming: Stream data entries for real-time data processing.
# Large Calculations: Break down massive calculations into smaller, more manageable chunks.

In [84]:
import pandas as pd

df_employees = pd.DataFrame(employees)
df_employees

      name  age  salary
0    Alice   25   80000
1      Bob   25   50000
2  Charlie   35  120000

In [92]:
value = df_employees.iloc[1,1]
print(value)

25

In [97]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}
 
#load data into a DataFrame object:
df = pd.DataFrame(data)
df

   calories  duration
0       420        50
1       380        40
2       390        45

In [101]:
df['score'] = [55,90,85]

In [102]:
df

   calories  duration  score
0       420        50     55
1       380        40     90
2       390        45     85

In [98]:
value = df.iloc[1,1]
print(value)

40